app/controllers/main_controller.rb

INSERT INTO "students" ("name", "score", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "moo"], ["score", 50.0], ["created_at", "2022-09-13 18:14:37.889148"], ["updated_at", "2022-09-13 18:14:37.889148"]]
---
  def out
    @max_sub = "none"
    @max_all = 0.0
    @sum = 0.0
    for i in 1..$global_num do
      student = Student.new
      student.name = $name[i-1]
      student.score = $score[i-1]
      student.save