app/controllers/score_controller.rb

  def list
    @stu_all = Student.all
---
SELECT "students".* FROM "students" ORDER BY "students"."id" ASC LIMIT ?  [["LIMIT", 1]]

  def edit
    if(params[:isRoot] == 'true')
      @id = params[:id]
      @name = Student.find(@id).name
      @score = Student.find(@id).score
    else
      @id = params[:id]
      @x = Student.find(@id)
      @x.name = params[:name]
      @x.score = params[:score].to_f
      @x.save!
---
SELECT "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
UPDATE "students" SET "score" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["score", 2.0], ["updated_at", "2022-09-15 04:22:09.961233"], ["id", 3]]

  def delete
    Student.destroy_by(id: params[:id])
---
DELETE FROM "students" WHERE "students"."id" = ?  [["id", 1]]